app/controllers/boards_controller.rb

	def index
		@boards = User.find(4).get_boards
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def show
		@boardslists = User.find(4).get_list(params[:trello])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]